ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32WBxx/stm32wb35xx.h
#define DMAMUX1_RequestGenerator0  ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator0_BASE)
#define DMAMUX1_RequestGenerator1  ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator1_BASE)
#define DMAMUX1_RequestGenerator2  ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator2_BASE)
#define DMAMUX1_RequestGenerator3  ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator3_BASE)

#define DMAMUX1_ChannelStatus      ((DMAMUX_ChannelStatus_TypeDef *) DMAMUX1_ChannelStatus_BASE)
#define DMAMUX1_RequestGenStatus   ((DMAMUX_RequestGenStatus_TypeDef *) DMAMUX1_RequestGenStatus_BASE)

#define CRC                 ((CRC_TypeDef *) CRC_BASE)

/* Peripherals available on AHB2 bus */
#define GPIOA               ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB               ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC               ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOE               ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOH               ((GPIO_TypeDef *) GPIOH_BASE)

#define ADC1                ((ADC_TypeDef *) ADC1_BASE)
#define ADC1_COMMON         ((ADC_Common_TypeDef *) ADC1_COMMON_BASE)

#define AES1                ((AES_TypeDef *) AES1_BASE)

/* Peripherals available on AHB shared bus */
#define RCC                 ((RCC_TypeDef *) RCC_BASE)
#define PWR                 ((PWR_TypeDef *) PWR_BASE)
#define EXTI                ((EXTI_TypeDef *) EXTI_BASE)
#define IPCC                ((IPCC_TypeDef *) IPCC_BASE)
#define IPCC_C1             ((IPCC_CommonTypeDef *) IPCC_BASE)
#define IPCC_C2             ((IPCC_CommonTypeDef *) (IPCC_BASE + 0x10U))
#define RNG                 ((RNG_TypeDef *) RNG_BASE)
#define HSEM                ((HSEM_TypeDef *) HSEM_BASE)
#define HSEM_COMMON         ((HSEM_Common_TypeDef *) (HSEM_BASE + 0x100U))
#define AES2                ((AES_TypeDef *) AES2_BASE)
#define PKA                 ((PKA_TypeDef *) PKA_BASE)
#define FLASH               ((FLASH_TypeDef *) FLASH_REG_BASE)

/* Peripherals available on AHB3 bus */
#define QUADSPI             ((QUADSPI_TypeDef *) QUADSPI_R_BASE)

#define DBGMCU              ((DBGMCU_TypeDef *) DBGMCU_BASE)
/**
  * @}
  */

/** @addtogroup Exported_constants
  * @{
  */

/** @addtogroup Peripheral_Registers_Bits_Definition
  * @{
  */

/******************************************************************************/
/*                         Peripheral Registers Bits Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                      Analog to Digital Converter (ADC)                     */
/*                                                                            */
/******************************************************************************/

#define ADC_SUPPORT_5_MSPS   /* ADC sampling rate 5 Msamples/sec */

/********************  Bit definition for ADC_ISR register  *******************/
#define ADC_ISR_ADRDY_Pos            (0U)                                    
#define ADC_ISR_ADRDY_Msk            (0x1UL << ADC_ISR_ADRDY_Pos)              /*!< 0x00000001 */
#define ADC_ISR_ADRDY                ADC_ISR_ADRDY_Msk                         /*!< ADC ready flag */
#define ADC_ISR_EOSMP_Pos            (1U)                                      
#define ADC_ISR_EOSMP_Msk            (0x1UL << ADC_ISR_EOSMP_Pos)              /*!< 0x00000002 */
#define ADC_ISR_EOSMP                ADC_ISR_EOSMP_Msk                         /*!< ADC group regular end of sampling flag */
#define ADC_ISR_EOC_Pos              (2U)                                      
#define ADC_ISR_EOC_Msk              (0x1UL << ADC_ISR_EOC_Pos)                /*!< 0x00000004 */
#define ADC_ISR_EOC                  ADC_ISR_EOC_Msk                           /*!< ADC group regular end of unitary conversion flag */
#define ADC_ISR_EOS_Pos              (3U)                                      
#define ADC_ISR_EOS_Msk              (0x1UL << ADC_ISR_EOS_Pos)                /*!< 0x00000008 */
#define ADC_ISR_EOS                  ADC_ISR_EOS_Msk                           /*!< ADC group regular end of sequence conversions flag */
#define ADC_ISR_OVR_Pos              (4U)                                      
#define ADC_ISR_OVR_Msk              (0x1UL << ADC_ISR_OVR_Pos)                /*!< 0x00000010 */
#define ADC_ISR_OVR                  ADC_ISR_OVR_Msk                           /*!< ADC group regular overrun flag */
#define ADC_ISR_JEOC_Pos             (5U)                                      
#define ADC_ISR_JEOC_Msk             (0x1UL << ADC_ISR_JEOC_Pos)               /*!< 0x00000020 */
#define ADC_ISR_JEOC                 ADC_ISR_JEOC_Msk                          /*!< ADC group injected end of unitary conversion flag */
#define ADC_ISR_JEOS_Pos             (6U)                                      
#define ADC_ISR_JEOS_Msk             (0x1UL << ADC_ISR_JEOS_Pos)               /*!< 0x00000040 */
#define ADC_ISR_JEOS                 ADC_ISR_JEOS_Msk                          /*!< ADC group injected end of sequence conversions flag */
#define ADC_ISR_AWD1_Pos             (7U)                                      
#define ADC_ISR_AWD1_Msk             (0x1UL << ADC_ISR_AWD1_Pos)               /*!< 0x00000080 */
#define ADC_ISR_AWD1                 ADC_ISR_AWD1_Msk                          /*!< ADC analog watchdog 1 flag */
#define ADC_ISR_AWD2_Pos             (8U)                                      
#define ADC_ISR_AWD2_Msk             (0x1UL << ADC_ISR_AWD2_Pos)               /*!< 0x00000100 */
#define ADC_ISR_AWD2                 ADC_ISR_AWD2_Msk                          /*!< ADC analog watchdog 2 flag */
#define ADC_ISR_AWD3_Pos             (9U)                                      
#define ADC_ISR_AWD3_Msk             (0x1UL << ADC_ISR_AWD3_Pos)               /*!< 0x00000200 */
#define ADC_ISR_AWD3                 ADC_ISR_AWD3_Msk                          /*!< ADC analog watchdog 3 flag */
#define ADC_ISR_JQOVF_Pos            (10U)                                     
#define ADC_ISR_JQOVF_Msk            (0x1UL << ADC_ISR_JQOVF_Pos)              /*!< 0x00000400 */
#define ADC_ISR_JQOVF                ADC_ISR_JQOVF_Msk                         /*!< ADC group injected contexts queue overflow flag */

/********************  Bit definition for ADC_IER register  *******************/
#define ADC_IER_ADRDYIE_Pos          (0U)                                      
#define ADC_IER_ADRDYIE_Msk          (0x1UL << ADC_IER_ADRDYIE_Pos)            /*!< 0x00000001 */
#define ADC_IER_ADRDYIE              ADC_IER_ADRDYIE_Msk                       /*!< ADC ready interrupt */
#define ADC_IER_EOSMPIE_Pos          (1U)                                      
#define ADC_IER_EOSMPIE_Msk          (0x1UL << ADC_IER_EOSMPIE_Pos)            /*!< 0x00000002 */
#define ADC_IER_EOSMPIE              ADC_IER_EOSMPIE_Msk                       /*!< ADC group regular end of sampling interrupt */
#define ADC_IER_EOCIE_Pos            (2U)                                      
#define ADC_IER_EOCIE_Msk            (0x1UL << ADC_IER_EOCIE_Pos)              /*!< 0x00000004 */
#define ADC_IER_EOCIE                ADC_IER_EOCIE_Msk                         /*!< ADC group regular end of unitary conversion interrupt */
#define ADC_IER_EOSIE_Pos            (3U)                                      
#define ADC_IER_EOSIE_Msk            (0x1UL << ADC_IER_EOSIE_Pos)              /*!< 0x00000008 */
#define ADC_IER_EOSIE                ADC_IER_EOSIE_Msk                         /*!< ADC group regular end of sequence conversions interrupt */
#define ADC_IER_OVRIE_Pos            (4U)                                      
#define ADC_IER_OVRIE_Msk            (0x1UL << ADC_IER_OVRIE_Pos)              /*!< 0x00000010 */
#define ADC_IER_OVRIE                ADC_IER_OVRIE_Msk                         /*!< ADC group regular overrun interrupt */
#define ADC_IER_JEOCIE_Pos           (5U)                                      
#define ADC_IER_JEOCIE_Msk           (0x1UL << ADC_IER_JEOCIE_Pos)             /*!< 0x00000020 */
#define ADC_IER_JEOCIE               ADC_IER_JEOCIE_Msk                        /*!< ADC group injected end of unitary conversion interrupt */
#define ADC_IER_JEOSIE_Pos           (6U)                                      
#define ADC_IER_JEOSIE_Msk           (0x1UL << ADC_IER_JEOSIE_Pos)             /*!< 0x00000040 */
#define ADC_IER_JEOSIE               ADC_IER_JEOSIE_Msk                        /*!< ADC group injected end of sequence conversions interrupt */
#define ADC_IER_AWD1IE_Pos           (7U)                                      
#define ADC_IER_AWD1IE_Msk           (0x1UL << ADC_IER_AWD1IE_Pos)             /*!< 0x00000080 */
#define ADC_IER_AWD1IE               ADC_IER_AWD1IE_Msk                        /*!< ADC analog watchdog 1 interrupt */
#define ADC_IER_AWD2IE_Pos           (8U)                                      
#define ADC_IER_AWD2IE_Msk           (0x1UL << ADC_IER_AWD2IE_Pos)             /*!< 0x00000100 */
#define ADC_IER_AWD2IE               ADC_IER_AWD2IE_Msk                        /*!< ADC analog watchdog 2 interrupt */
#define ADC_IER_AWD3IE_Pos           (9U)                                      
#define ADC_IER_AWD3IE_Msk           (0x1UL << ADC_IER_AWD3IE_Pos)             /*!< 0x00000200 */
#define ADC_IER_AWD3IE               ADC_IER_AWD3IE_Msk                        /*!< ADC analog watchdog 3 interrupt */
#define ADC_IER_JQOVFIE_Pos          (10U)                                     
#define ADC_IER_JQOVFIE_Msk          (0x1UL << ADC_IER_JQOVFIE_Pos)            /*!< 0x00000400 */
#define ADC_IER_JQOVFIE              ADC_IER_JQOVFIE_Msk                       /*!< ADC group injected contexts queue overflow interrupt */

/********************  Bit definition for ADC_CR register  ********************/
#define ADC_CR_ADEN_Pos              (0U)                                      
#define ADC_CR_ADEN_Msk              (0x1UL << ADC_CR_ADEN_Pos)                /*!< 0x00000001 */
#define ADC_CR_ADEN                  ADC_CR_ADEN_Msk                           /*!< ADC enable */
#define ADC_CR_ADDIS_Pos             (1U)                                      
#define ADC_CR_ADDIS_Msk             (0x1UL << ADC_CR_ADDIS_Pos)               /*!< 0x00000002 */
#define ADC_CR_ADDIS                 ADC_CR_ADDIS_Msk                          /*!< ADC disable */
#define ADC_CR_ADSTART_Pos           (2U)                                      
#define ADC_CR_ADSTART_Msk           (0x1UL << ADC_CR_ADSTART_Pos)             /*!< 0x00000004 */
#define ADC_CR_ADSTART               ADC_CR_ADSTART_Msk                        /*!< ADC group regular conversion start */
#define ADC_CR_JADSTART_Pos          (3U)                                      
#define ADC_CR_JADSTART_Msk          (0x1UL << ADC_CR_JADSTART_Pos)            /*!< 0x00000008 */
#define ADC_CR_JADSTART              ADC_CR_JADSTART_Msk                       /*!< ADC group injected conversion start */
#define ADC_CR_ADSTP_Pos             (4U)                                      
#define ADC_CR_ADSTP_Msk             (0x1UL << ADC_CR_ADSTP_Pos)               /*!< 0x00000010 */
#define ADC_CR_ADSTP                 ADC_CR_ADSTP_Msk                          /*!< ADC group regular conversion stop */
#define ADC_CR_JADSTP_Pos            (5U)                                      
#define ADC_CR_JADSTP_Msk            (0x1UL << ADC_CR_JADSTP_Pos)              /*!< 0x00000020 */
#define ADC_CR_JADSTP                ADC_CR_JADSTP_Msk                         /*!< ADC group injected conversion stop */
#define ADC_CR_ADVREGEN_Pos          (28U)                                     
#define ADC_CR_ADVREGEN_Msk          (0x1UL << ADC_CR_ADVREGEN_Pos)            /*!< 0x10000000 */
#define ADC_CR_ADVREGEN              ADC_CR_ADVREGEN_Msk                       /*!< ADC voltage regulator enable */
#define ADC_CR_DEEPPWD_Pos           (29U)                                     
#define ADC_CR_DEEPPWD_Msk           (0x1UL << ADC_CR_DEEPPWD_Pos)             /*!< 0x20000000 */
#define ADC_CR_DEEPPWD               ADC_CR_DEEPPWD_Msk                        /*!< ADC deep power down enable */
#define ADC_CR_ADCALDIF_Pos          (30U)                                     
#define ADC_CR_ADCALDIF_Msk          (0x1UL << ADC_CR_ADCALDIF_Pos)            /*!< 0x40000000 */
#define ADC_CR_ADCALDIF              ADC_CR_ADCALDIF_Msk                       /*!< ADC differential mode for calibration */
#define ADC_CR_ADCAL_Pos             (31U)                                     
#define ADC_CR_ADCAL_Msk             (0x1UL << ADC_CR_ADCAL_Pos)               /*!< 0x80000000 */
#define ADC_CR_ADCAL                 ADC_CR_ADCAL_Msk                          /*!< ADC calibration */

