ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32WBxx/stm32wb35xx.h
/********************  Bit definition for PWR_PUCRE register  *****************/
#define PWR_PUCRE_PE0_Pos              (0U)                                    
#define PWR_PUCRE_PE0_Msk              (0x1UL << PWR_PUCRE_PE0_Pos)            /*!< 0x00000001 */
#define PWR_PUCRE_PE0                  PWR_PUCRE_PE0_Msk                       /*!< Pin PE0 Pull-Up set */
#define PWR_PUCRE_PE1_Pos              (1U)                                    
#define PWR_PUCRE_PE1_Msk              (0x1UL << PWR_PUCRE_PE1_Pos)            /*!< 0x00000002 */
#define PWR_PUCRE_PE1                  PWR_PUCRE_PE1_Msk                       /*!< Pin PE1 Pull-Up set */
#define PWR_PUCRE_PE2_Pos              (2U)                                    
#define PWR_PUCRE_PE2_Msk              (0x1UL << PWR_PUCRE_PE2_Pos)            /*!< 0x00000004 */
#define PWR_PUCRE_PE2                  PWR_PUCRE_PE2_Msk                       /*!< Pin PE2 Pull-Up set */
#define PWR_PUCRE_PE3_Pos              (3U)                                    
#define PWR_PUCRE_PE3_Msk              (0x1UL << PWR_PUCRE_PE3_Pos)            /*!< 0x00000008 */
#define PWR_PUCRE_PE3                  PWR_PUCRE_PE3_Msk                       /*!< Pin PE3 Pull-Up set */
#define PWR_PUCRE_PE4_Pos              (4U)                                    
#define PWR_PUCRE_PE4_Msk              (0x1UL << PWR_PUCRE_PE4_Pos)            /*!< 0x00000010 */
#define PWR_PUCRE_PE4                  PWR_PUCRE_PE4_Msk                       /*!< Pin PE4 Pull-Up set */

/********************  Bit definition for PWR_PDCRE register  *****************/
#define PWR_PDCRE_PE0_Pos              (0U)                                    
#define PWR_PDCRE_PE0_Msk              (0x1UL << PWR_PDCRE_PE0_Pos)            /*!< 0x00000001 */
#define PWR_PDCRE_PE0                  PWR_PDCRE_PE0_Msk                       /*!< Pin PE0 Pull-Down set */
#define PWR_PDCRE_PE1_Pos              (1U)                                    
#define PWR_PDCRE_PE1_Msk              (0x1UL << PWR_PDCRE_PE1_Pos)            /*!< 0x00000002 */
#define PWR_PDCRE_PE1                  PWR_PDCRE_PE1_Msk                       /*!< Pin PE1 Pull-Down set */
#define PWR_PDCRE_PE2_Pos              (2U)                                    
#define PWR_PDCRE_PE2_Msk              (0x1UL << PWR_PDCRE_PE2_Pos)            /*!< 0x00000004 */
#define PWR_PDCRE_PE2                  PWR_PDCRE_PE2_Msk                       /*!< Pin PE2 Pull-Down set */
#define PWR_PDCRE_PE3_Pos              (3U)                                    
#define PWR_PDCRE_PE3_Msk              (0x1UL << PWR_PDCRE_PE3_Pos)            /*!< 0x00000008 */
#define PWR_PDCRE_PE3                  PWR_PDCRE_PE3_Msk                       /*!< Pin PE3 Pull-Down set */
#define PWR_PDCRE_PE4_Pos              (4U)                                    
#define PWR_PDCRE_PE4_Msk              (0x1UL << PWR_PDCRE_PE4_Pos)            /*!< 0x00000010 */
#define PWR_PDCRE_PE4                  PWR_PDCRE_PE4_Msk                       /*!< Pin PE4 Pull-Down set */

/********************  Bit definition for PWR_PUCRH register  *****************/
#define PWR_PUCRH_PH0_Pos              (0U)                                    
#define PWR_PUCRH_PH0_Msk              (0x1UL << PWR_PUCRH_PH0_Pos)            /*!< 0x00000001 */
#define PWR_PUCRH_PH0                  PWR_PUCRH_PH0_Msk                       /*!< Pin PH0 Pull-Up set */
#define PWR_PUCRH_PH1_Pos              (1U)                                    
#define PWR_PUCRH_PH1_Msk              (0x1UL << PWR_PUCRH_PH1_Pos)            /*!< 0x00000002 */
#define PWR_PUCRH_PH1                  PWR_PUCRH_PH1_Msk                       /*!< Pin PH1 Pull-Up set */
#define PWR_PUCRH_PH3_Pos              (3U)                                    
#define PWR_PUCRH_PH3_Msk              (0x1UL << PWR_PUCRH_PH3_Pos)            /*!< 0x00000004 */
#define PWR_PUCRH_PH3                  PWR_PUCRH_PH3_Msk                       /*!< Pin PH3 Pull-Up set */

/********************  Bit definition for PWR_PDCRH register  *****************/
#define PWR_PDCRH_PH0_Pos              (0U)                                    
#define PWR_PDCRH_PH0_Msk              (0x1UL << PWR_PDCRH_PH0_Pos)            /*!< 0x00000001 */
#define PWR_PDCRH_PH0                  PWR_PDCRH_PH0_Msk                       /*!< Pin PH0 Pull-Down set */
#define PWR_PDCRH_PH1_Pos              (1U)                                    
#define PWR_PDCRH_PH1_Msk              (0x1UL << PWR_PDCRH_PH1_Pos)            /*!< 0x00000002 */
#define PWR_PDCRH_PH1                  PWR_PDCRH_PH1_Msk                       /*!< Pin PH1 Pull-Down set */
#define PWR_PDCRH_PH3_Pos              (3U)                                    
#define PWR_PDCRH_PH3_Msk              (0x1UL << PWR_PDCRH_PH3_Pos)            /*!< 0x00000004 */
#define PWR_PDCRH_PH3                  PWR_PDCRH_PH3_Msk                       /*!< Pin PH3 Pull-Down set */

/********************  Bit definition for PWR_C2CR1 register  ********************/
#define PWR_C2CR1_LPMS_Pos             (0U)                                    
#define PWR_C2CR1_LPMS_Msk             (0x7UL << PWR_C2CR1_LPMS_Pos)           /*!< 0x00000007 */
#define PWR_C2CR1_LPMS                 PWR_C2CR1_LPMS_Msk                      /*!< Low Power Mode Selection for CPU2 */
#define PWR_C2CR1_LPMS_0               (0x1U << PWR_C2CR1_LPMS_Pos)            /*!< 0x00000001 */
#define PWR_C2CR1_LPMS_1               (0x2U << PWR_C2CR1_LPMS_Pos)            /*!< 0x00000002 */
#define PWR_C2CR1_LPMS_2               (0x4U << PWR_C2CR1_LPMS_Pos)            /*!< 0x00000004 */

#define PWR_C2CR1_FPDR_Pos             (4U)                                    
#define PWR_C2CR1_FPDR_Msk             (0x1UL << PWR_C2CR1_FPDR_Pos)           /*!< 0x00000010 */
#define PWR_C2CR1_FPDR                 PWR_C2CR1_FPDR_Msk                      /*!< Flash power down mode during LPrun for CPU2 */

#define PWR_C2CR1_FPDS_Pos             (5U)                                    
#define PWR_C2CR1_FPDS_Msk             (0x1UL << PWR_C2CR1_FPDS_Pos)           /*!< 0x00000020 */
#define PWR_C2CR1_FPDS                 PWR_C2CR1_FPDS_Msk                      /*!< Flash power down mode during LPsleep for CPU2 */

#define PWR_C2CR1_BLEEWKUP_Pos         (14U)                                   
#define PWR_C2CR1_BLEEWKUP_Msk         (0x1UL << PWR_C2CR1_BLEEWKUP_Pos)       /*!< 0x00008000 */
#define PWR_C2CR1_BLEEWKUP             PWR_C2CR1_BLEEWKUP_Msk                  /*!< Radio BLE external wakeup signal */

#define PWR_C2CR1_802EWKUP_Pos         (15U)                                   
#define PWR_C2CR1_802EWKUP_Msk         (0x1UL << PWR_C2CR1_802EWKUP_Pos)       /*!< 0x00008000 */
#define PWR_C2CR1_802EWKUP             PWR_C2CR1_802EWKUP_Msk                  /*!< Radio 802.15.4 external wakeup signal */

/********************  Bit definition for PWR_C2CR3 register  ********************/
#define PWR_C2CR3_EWUP_Pos             (0U)                                    
#define PWR_C2CR3_EWUP_Msk             (0x09UL << PWR_C2CR3_EWUP_Pos)           /*!< 0x00000009 */
#define PWR_C2CR3_EWUP                 PWR_C2CR3_EWUP_Msk                       /*!< Enable all external Wake-Up lines for CPU2 */
#define PWR_C2CR3_EWUP1_Pos            (0U)                                    
#define PWR_C2CR3_EWUP1_Msk            (0x1UL << PWR_C2CR3_EWUP1_Pos)           /*!< 0x00000001 */
#define PWR_C2CR3_EWUP1                PWR_C2CR3_EWUP1_Msk                      /*!< Enable external WKUP Pin 1 [line 0] for CPU2 */
#define PWR_C2CR3_EWUP4_Pos            (3U)                                    
#define PWR_C2CR3_EWUP4_Msk            (0x1UL << PWR_C2CR3_EWUP4_Pos)           /*!< 0x00000008 */
#define PWR_C2CR3_EWUP4                PWR_C2CR3_EWUP4_Msk                      /*!< Enable external WKUP Pin 4 [line 3] for CPU2 */

#define PWR_C2CR3_EBLEWUP_Pos          (9U)                                    
#define PWR_C2CR3_EBLEWUP_Msk          (0x1UL << PWR_C2CR3_EBLEWUP_Pos)       /*!< 0x00000200 */
#define PWR_C2CR3_EBLEWUP              PWR_C2CR3_EBLEWUP_Msk                 /*!< Enable BLE host wakeup interrupt for CPU2 */
#define PWR_C2CR3_E802WUP_Pos          (10U)                                   
#define PWR_C2CR3_E802WUP_Msk          (0x1UL << PWR_C2CR3_E802WUP_Pos)       /*!< 0x00000400 */
#define PWR_C2CR3_E802WUP              PWR_C2CR3_E802WUP_Msk                  /*!< Enable BLE host wakeup interrupt for CPU2 */

